Revit 2024 API
BuiltInFailures.ColumnFailures.ColumnAndTargetAreConcrete Property
 Column and target are both concrete. Geometries have been joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ColumnAndTargetAreConcrete { get; }
Visual Basic
Public Shared ReadOnly Property ColumnAndTargetAreConcrete As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ColumnAndTargetAreConcrete {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace